bscopix/Ble_Mesh_Kp/STM32_WPAN/App/p2p_server_app.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file    App/p2p_server_app.c
  * @author  MCD Application Team
  * @brief   Peer to peer Server Application
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "app_common.h"
#include "dbg_trace.h"
#include "ble.h"
#include "p2p_server_app.h"
#include "stm32_seq.h"
#include "nfc_eeprom_mngt.h"
#include "ble_mesh.h"
#include "appli_mesh.h"
#include "mode_manager.h"
#include "target_config_service.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
 extern UART_HandleTypeDef 	hlpuart1;
 #include "ctor10-w_data.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

 
 PLACE_IN_SECTION("BLE_APP_CONTEXT") P2P_Server_App_Context_t P2P_Server_App_Context;
/* USER CODE END PTD */

/* Private defines ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

#define P2P_CTRL_OPCODE_MESH_DEPROVISION            0x08U
#define P2P_CTRL_OPCODE_GET_PROVISIONING_STATUS     0x09U
#define P2P_CTRL_OPCODE_ENTER_PROVISIONING          0x0AU
#define P2P_CTRL_OPCODE_CANCEL_PROVISIONING         0x0BU
#define P2P_CTRL_OPCODE_MESH_HARD_FACTORY_RESET     0x0CU
#define P2P_CTRL_OPCODE_SOFT_REBOOT                 0x0DU
#define P2P_CTRL_OPCODE_ENTER_MESH                  0x10U
#define P2P_CTRL_OPCODE_GET_MODE_STATUS             0x11U
#define P2P_CTRL_OPCODE_GET_CAPABILITIES            0x12U
#define P2P_CTRL_OPCODE_TARGET_CONFIG                0x13U

#define P2P_CTRL_STATUS_OK                          0x00U
#define P2P_CTRL_STATUS_BAD_LENGTH                  0x01U
#define P2P_CTRL_STATUS_BAD_STATE                   0x02U
#define P2P_CTRL_STATUS_BUSY                        0x03U
#define P2P_CTRL_STATUS_INTERNAL_ERROR              0x04U

#define P2P_CTRL_MAX_WRITE_LEN                      20U

/* USER CODE END PD */

/* Private macros -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
/* USER CODE BEGIN PV */
static uint8_t P2P_CtrlWritePending;
static uint8_t P2P_CtrlWriteLen;
static uint8_t P2P_CtrlWritePayload[P2P_CTRL_MAX_WRITE_LEN];

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
/* USER CODE BEGIN PFP */

static void P2PS_Send_Raw_Notification(void);
static void P2PS_Send_Shot_Notification(void);
static void P2PS_Send_Target_Notification(void);
static void P2PS_Send_Ctl_Response(uint8_t request_opcode, uint8_t status, const uint8_t *payload, uint8_t payload_len);
static void P2PS_Build_Provisioning_Status(uint8_t *status_payload4);
static void P2PS_Handle_Mesh_Control_Write(const uint8_t *payload, uint8_t length);
static void P2PS_Process_Pending_Ctrl_Write(void);
uint8_t Tx_data[2];
	uint8_t tab_emul[14];
	uint8_t RetValToRead;
/* USER CODE END PFP */

/* Functions Definition ------------------------------------------------------*/
void P2PS_STM_App_Notification(P2PS_STM_App_Notification_evt_t *pNotification)
{
/* USER CODE BEGIN P2PS_STM_App_Notification_1 */

/* USER CODE END P2PS_STM_App_Notification_1 */
  switch(pNotification->P2P_Evt_Opcode)
  {
/* USER CODE BEGIN P2PS_STM_App_Notification_P2P_Evt_Opcode */
#if(BLE_CFG_OTA_REBOOT_CHAR != 0)
    case P2PS_STM_BOOT_REQUEST_EVT:
      APP_DBG_MSG("-- P2P APPLICATION SERVER : BOOT REQUESTED\n");
      APP_DBG_MSG(" \n\r");

      *(uint32_t*)SRAM1_BASE = *(uint32_t*)pNotification->DataTransfered.pPayload;
      NVIC_SystemReset();
      break;
#endif
/* USER CODE END P2PS_STM_App_Notification_P2P_Evt_Opcode */

    case P2PS_STM_NOTIFY_SHOT_ENABLED_EVT:
/* USER CODE BEGIN P2PS_STM__NOTIFY_ENABLED_EVT */
      P2P_Server_App_Context.ShotNotification_Status = 1;
      APP_DBG_MSG("-- P2P APPLICATION SERVER : NOTIFICATION SHOT ENABLED\r\n"); 
      APP_DBG_MSG(" \n\r");
/* USER CODE END P2PS_STM__NOTIFY_ENABLED_EVT */
      break;

    case P2PS_STM_NOTIFY_SHOT_DISABLED_EVT:
/* USER CODE BEGIN P2PS_STM_NOTIFY_DISABLED_EVT */
      P2P_Server_App_Context.ShotNotification_Status = 0;
      APP_DBG_MSG("-- P2P APPLICATION SERVER : NOTIFICATION SHOT DISABLED\r\n");
      APP_DBG_MSG(" \n\r");
/* USER CODE END P2PS_STM_NOTIFY_DISABLED_EVT */
      break;

    case P2PS_STM_WRITE_EVT:
/* USER CODE BEGIN P2PS_STM_WRITE_EVT */
      if (pNotification->DataTransfered.Length > 0U)
      {
        uint8_t opcode = pNotification->DataTransfered.pPayload[0];

        if (opcode == P2P_CTRL_OPCODE_SOFT_REBOOT)
        {
          /* On attend 1 octet (opcode seul) */
          if (pNotification->DataTransfered.Length != 1U)
          {
            P2PS_Send_Ctl_Response(opcode, P2P_CTRL_STATUS_BAD_LENGTH, NULL, 0U);
            break;
          }
          P2PS_Send_Ctl_Response(opcode, P2P_CTRL_STATUS_OK, NULL, 0U);
          APP_DBG_MSG("SOFT_REBOOT accepted\r\n");
          HAL_Delay(100U);
          NVIC_SystemReset();
        }

        if ((opcode == P2P_CTRL_OPCODE_MESH_DEPROVISION)
          || (opcode == P2P_CTRL_OPCODE_GET_PROVISIONING_STATUS)
            || (opcode == P2P_CTRL_OPCODE_ENTER_PROVISIONING)
            || (opcode == P2P_CTRL_OPCODE_CANCEL_PROVISIONING)
            || (opcode == P2P_CTRL_OPCODE_MESH_HARD_FACTORY_RESET)
            || (opcode == P2P_CTRL_OPCODE_ENTER_MESH)
            || (opcode == P2P_CTRL_OPCODE_GET_MODE_STATUS)
            || (opcode == P2P_CTRL_OPCODE_GET_CAPABILITIES)
            || (opcode == P2P_CTRL_OPCODE_TARGET_CONFIG))
        {
          if (pNotification->DataTransfered.Length <= P2P_CTRL_MAX_WRITE_LEN)
          {
            /* ENTER_PROVISIONING must be handled immediately to avoid
             * scheduler latency preventing the expected reboot path. */
            if (opcode == P2P_CTRL_OPCODE_ENTER_PROVISIONING)
            {
              APP_DBG_MSG("P2P ctrl immediate: op=0x%02x len=%u\r\n",
                          opcode,
                          pNotification->DataTransfered.Length);
              P2PS_Handle_Mesh_Control_Write(pNotification->DataTransfered.pPayload,
                                             pNotification->DataTransfered.Length);
            }
            else
            {
              memcpy(P2P_CtrlWritePayload,
                     pNotification->DataTransfered.pPayload,
                     pNotification->DataTransfered.Length);
              P2P_CtrlWriteLen = pNotification->DataTransfered.Length;
              P2P_CtrlWritePending = 1U;
              APP_DBG_MSG("P2P ctrl queued: op=0x%02x len=%u\r\n",
                          opcode,
                          pNotification->DataTransfered.Length);
              UTIL_SEQ_SetTask(1 << CFG_TASK_P2P_CTRL_REQ_ID, CFG_SCH_PRIO_0);
            }
          }
          else
          {
            APP_DBG_MSG("P2P ctrl write dropped: length=%u > %u\r\n",
                        pNotification->DataTransfered.Length,
                        (unsigned int)P2P_CTRL_MAX_WRITE_LEN);
          }
          break;
        }

        if ((IsProvisioningRuntimeSessionActive() == true) ||
            (GetProvisioningResult() == PROVISION_RESULT_SUCCESS))
        {
          APP_DBG_MSG("Legacy P2P opcode ignored while Mesh/Proxy active: op=0x%02x len=%u\r\n",
                      opcode,
                      pNotification->DataTransfered.Length);
          break;
        }
      }

      if (pNotification->DataTransfered.Length == 0U)
      {
        break;
      }

      if(pNotification->DataTransfered.pPayload[0] == 0x00){ /* Direct connection to UART_TX */
    	  memcpy(Tx_data, &pNotification->DataTransfered.pPayload[1],2);
				APP_DBG_MSG("Send Command %02x %02x %02x\r\n",
                    pNotification->DataTransfered.pPayload[0],
                    pNotification->DataTransfered.pPayload[1],
                    pNotification->DataTransfered.pPayload[2]);
        HAL_UART_Transmit(&hlpuart1,Tx_data,1,1000);
	  }
			if(pNotification->DataTransfered.pPayload[0] == 0x01){ /* Led Test */
    	  if(pNotification->DataTransfered.pPayload[1] == 0x01){
//					HAL_GPIO_WritePin(LD1_GPIO_Port, LD1_Pin, GPIO_PIN_SET);
					APP_DBG_MSG("Led blue set\n");
				}
			if(pNotification->DataTransfered.pPayload[1] == 0x00){
//					HAL_GPIO_WritePin(LD1_GPIO_Port, LD1_Pin, GPIO_PIN_RESET);
				APP_DBG_MSG("Led blue reset\n");
				}
	  }
			/* ----------- NOUVEAU : Set SSID via BLE (opcode 0x07) ---------- */
		if(pNotification->DataTransfered.pPayload[0] == 0x07){ /* Set SSID name */
			uint8_t len = pNotification->DataTransfered.Length;  // longueur totale du payload

			if(len > 1)
			{
				char newSsid[16 + 1];  // 16 caract�res max + '\0'
				uint8_t nameLen = (uint8_t)(len - 1); // on enl�ve l�octet d�opcode

