bscopix/Ble_Mesh_Kp/STM32_WPAN/App/p2p_server_app.c
				if(nameLen > 16)
					nameLen = 16;

				memset(newSsid, 0, sizeof(newSsid));
				memcpy(newSsid,
							 &pNotification->DataTransfered.pPayload[1],
							 nameLen);

				SetSSIDName(newSsid);  // �crit en EEPROM + met � jour le CRC de la zone NAME

				APP_DBG_MSG("Set SSID via BLE: %s\r\n", newSsid);
			}
		}
			if(pNotification->DataTransfered.pPayload[0] == 0x03){ /* Set timer */
					SetResetTimerValFinish(pNotification->DataTransfered.pPayload[1]);
					APP_DBG_MSG("Set reset timer Finish %02x %02x\r\n",
                    pNotification->DataTransfered.pPayload[0],
                    pNotification->DataTransfered.pPayload[1]);
			}
			if(pNotification->DataTransfered.pPayload[0] == 0x04){ /* Set timer */
					SetResetTimerValNotFinish(pNotification->DataTransfered.pPayload[1]);
					APP_DBG_MSG("Set reset timer Not Finish %02x %02x\r\n",
                    pNotification->DataTransfered.pPayload[0],
                    pNotification->DataTransfered.pPayload[1]);
			}
			if(pNotification->DataTransfered.pPayload[0] == 0x05){ /* SetMode SOLEMS /PSD */
					SetMode(pNotification->DataTransfered.pPayload[1]);
					APP_DBG_MSG("Set Mode\r\n");
			}
			if(pNotification->DataTransfered.pPayload[0] == 0x06){ //Read
				//GetTabShot();
				if (pNotification->DataTransfered.pPayload[1] == 0x03){
					RetValToRead = GetResetTimerValFinish();
					P2PS_STM_App_Update_Char(P2P_WRITE_CHAR_UUID,&RetValToRead,1);
					APP_DBG_MSG("Read reset timer Finish %02x \r\n", RetValToRead);
				}
				if (pNotification->DataTransfered.pPayload[1] == 0x04){
					RetValToRead = GetResetTimerValNotFinish();
					P2PS_STM_App_Update_Char(P2P_WRITE_CHAR_UUID,&RetValToRead,1);
					APP_DBG_MSG("Read reset timer Not Finish %02x \r\n", RetValToRead);
				} 
				if (pNotification->DataTransfered.pPayload[1] == 0x05){
					RetValToRead = GetMode();
					P2PS_STM_App_Update_Char(P2P_WRITE_CHAR_UUID,&RetValToRead,1);
					APP_DBG_MSG("Read Mode value %02x \r\n", RetValToRead);
				}
				if (pNotification->DataTransfered.pPayload[1] == 0x07){
					const char *ssid = GetSSIDName();
					uint8_t buf[16];
					uint8_t ssidLen = (uint8_t)strlen(ssid);
					if(ssidLen > 16)
						ssidLen = 16;

					memcpy(buf, ssid, ssidLen);

					P2PS_STM_App_Update_Char(P2P_WRITE_CHAR_UUID, buf, ssidLen);
					APP_DBG_MSG("Read SSID value: %s\r\n", ssid);
				}
			}
/* USER CODE END P2PS_STM_WRITE_EVT */
      break;
		case P2PS_STM_NOTIFY_RAW_ENABLED_EVT:
			P2P_Server_App_Context.RawNotification_Status = 1;
      APP_DBG_MSG("-- P2P APPLICATION SERVER : NOTIFICATION RAW ENABLED\r\n"); 
      APP_DBG_MSG(" \n\r");
			break;
		case P2PS_STM_NOTIFY_RAW_DISABLED_EVT:
			P2P_Server_App_Context.RawNotification_Status = 0;
      APP_DBG_MSG("-- P2P APPLICATION SERVER : NOTIFICATION RAW DISABLED\r\n");
      APP_DBG_MSG(" \n\r");
			break;
		case P2PS_STM_NOTIFY_TARGET_ENABLED_EVT:
			P2P_Server_App_Context.TargetNotification_Status = 1;
      APP_DBG_MSG("-- P2P APPLICATION SERVER : NOTIFICATION TARGET ENABLED\r\n"); 
      APP_DBG_MSG(" \n\r");
			break;
		case P2PS_STM_NOTIFY_TARGET_DISABLED_EVT:
			P2P_Server_App_Context.TargetNotification_Status = 0;
      APP_DBG_MSG("-- P2P APPLICATION SERVER : NOTIFICATION TARGET DISABLED\r\n");
      APP_DBG_MSG(" \n\r");
			break;
    default:
/* USER CODE BEGIN P2PS_STM_App_Notification_default */

/* USER CODE END P2PS_STM_App_Notification_default */
      break;
  }
/* USER CODE BEGIN P2PS_STM_App_Notification_2 */

/* USER CODE END P2PS_STM_App_Notification_2 */
  return;
}

void P2PS_APP_Notification(P2PS_APP_ConnHandle_Not_evt_t *pNotification)
{
/* USER CODE BEGIN P2PS_APP_Notification_1 */

/* USER CODE END P2PS_APP_Notification_1 */
  switch(pNotification->P2P_Evt_Opcode)
  {
/* USER CODE BEGIN P2PS_APP_Notification_P2P_Evt_Opcode */

/* USER CODE END P2PS_APP_Notification_P2P_Evt_Opcode */
  case PEER_CONN_HANDLE_EVT :
/* USER CODE BEGIN PEER_CONN_HANDLE_EVT */

/* USER CODE END PEER_CONN_HANDLE_EVT */
    break;

    case PEER_DISCON_HANDLE_EVT :
/* USER CODE BEGIN PEER_DISCON_HANDLE_EVT */

/* USER CODE END PEER_DISCON_HANDLE_EVT */
    break;

    default:
/* USER CODE BEGIN P2PS_APP_Notification_default */

/* USER CODE END P2PS_APP_Notification_default */
      break;
  }
/* USER CODE BEGIN P2PS_APP_Notification_2 */

/* USER CODE END P2PS_APP_Notification_2 */
  return;
}

void P2PS_APP_Init(void)
{
/* USER CODE BEGIN P2PS_APP_Init */
  UTIL_SEQ_RegTask( 1<< CFG_TASK_RAW_NOTIFICATION_ID, UTIL_SEQ_RFU, P2PS_Send_Raw_Notification );
  UTIL_SEQ_RegTask( 1<< CFG_TASK_SHOT_NOTIFICATION_ID, UTIL_SEQ_RFU, P2PS_Send_Shot_Notification );
  UTIL_SEQ_RegTask( 1<< CFG_TASK_TARGET_NOTIFICATION_ID, UTIL_SEQ_RFU, P2PS_Send_Target_Notification );
  UTIL_SEQ_RegTask( 1<< CFG_TASK_P2P_CTRL_REQ_ID, UTIL_SEQ_RFU, P2PS_Process_Pending_Ctrl_Write );
  ModeManager_RegisterTasks();

  P2P_Server_App_Context.ShotNotification_Status=0; 
	P2P_Server_App_Context.RawNotification_Status=0;
  P2P_CtrlWritePending = 0U;
  P2P_CtrlWriteLen = 0U;
/* USER CODE END P2PS_APP_Init */
  return;
}

/* USER CODE BEGIN FD */
void storeRawData(uint8_t *data, int lenght )
{
  if ((data == NULL) || (lenght <= 0))
  {
    return;
  }

  if ((uint32_t)lenght > (uint32_t)NOTIFY_RAW_SIZE)
  {
    lenght = NOTIFY_RAW_SIZE;
  }

	memcpy(P2P_Server_App_Context.RawTargetToNotification, data, (size_t)lenght);
}
void storeShotData(uint8_t *data, int lenght )
{
  if ((data == NULL) || (lenght <= 0))
  {
    return;
  }

  if ((uint32_t)lenght > (uint32_t)NOTIFY_SHOT_SIZE)
  {
    lenght = NOTIFY_SHOT_SIZE;
  }

	memcpy(P2P_Server_App_Context.ShotToNotification, data, (size_t)lenght);
}
void storeTargetData(uint8_t *data, int lenght )
{
  if ((data == NULL) || (lenght <= 0))
  {
    return;
  }

  if ((uint32_t)lenght > (uint32_t)NOTIFY_TARGET_SIZE)
  {
    lenght = NOTIFY_TARGET_SIZE;
  }

	memcpy(P2P_Server_App_Context.TargetToNotification, data, (size_t)lenght);
}

uint8_t P2PS_GetLastRawNotification(uint8_t *dst, uint8_t max_len)
{
  uint8_t copy_len = NOTIFY_RAW_SIZE;

